Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов2/ВКМ_МассовоеСозданиеАктов2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов2</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Докуме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом21_августа_новый/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом21_августа_новый/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалоДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов2/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда 
		Сообщить("Не заполнен период!"); 
		Возврат;
	КонецЕсли;
	
	//ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов();  
	//
	//Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
	//	
	//	Для Каждого Договор Из ДоговорыКонтрагентов Цикл
	//		НоваяСтрока = Объект.Данные.Добавить(); 
	//		НоваяСтрока.Договор = Договор; 
	//	КонецЦикла;
	//	
	//КонецЕсли;  

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьРеквизитыДокумента();
	ДокументОбъект.Записать();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыДокумента() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора КАК ВКМ_ДатаНачалоДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ВКМ_ДатаОкончанияДоговора
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = &Ложь
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора"; 
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);	
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.Данные.Очистить(); 

	МассивДокументов = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ВКМ_ДатаНачалоДоговора <= Объект.ДатаНачала И Выборка.ВКМ_ДатаОкончанияДоговора >= Объект.ДатаОкончания Тогда
			МассивДокументов.Добавить(Выборка.Договор);  
		КонецЕсли; 
	КонецЦикла;  

КонецПроцедуры


&НаКлиенте
Процедура СоздатьРеализации(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда 
		Сообщить("Не заполнен период!"); 
		Возврат;
	КонецЕсли;

	РассчитатьЗначение();
	
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьЗначение() 
	
    ДлительнаяОперация = НачатьВыполнениеНаСервере();
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);  
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервере()   
	
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
    ВыполняемыйМетод = "ВКМ_ДлительныеОперации.СозданиеРеализаций";
    ПараметрДанные = Объект.Данные.Выгрузить().Выгрузитьколонку("Договор");
	ПараметрПериод = Объект.ДатаОкончания;
    Возврат ДлительныеОперации.ВыполнитьФункцию(
        ПараметрыВыполнения,
        ВыполняемыйМетод,
        ПараметрДанные,
        ПараметрПериод);
		
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт 
	
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	//Если Результат.Статус = "Ошибка" Тогда
	//    СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.Ошибка);
	//    Возврат;
	//КонецЕсли; 
	
	Если Результат.Статус = "Выполнено" Тогда
    //ВывестиРезультат(Результат.АдресРезультата);
    СообщениеПользователю = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);   
	КонецЕсли;
	
КонецПроцедуры
